{"page":1,"total_results":4,"total_pages":1,"results":[{"vote_count":2119,"id":206487,"video":false,"vote_average":7.3,"title":"Predestination","popularity":12.669541,"poster_path":"\/kDdUtDsGMQ3OYwoBtEQyJIGPz4V.jpg","original_language":"en","original_title":"Predestination","genre_ids":[878,53],"backdrop_path":"\/s9DKwK5fXzaqFOzkZkidkOk4KR9.jpg","adult":false,"overview":"Predestination chronicles the life of a Temporal Agent sent on an intricate series of time-travel journeys designed to prevent future killers from committing their crimes. Now, on his final assignment, the Agent must stop the one criminal that has eluded him throughout time and prevent a devastating attack in which thousands of lives will be lost.","release_date":"2014-08-28"},{"vote_count":1,"id":316782,"video":false,"vote_average":4.5,"title":"Predestination","popularity":1.067899,"poster_path":"\/wufDu1f5nnD8hBXciiIxlOkEta7.jpg","original_language":"en","original_title":"Predestination","genre_ids":[18],"backdrop_path":null,"adult":false,"overview":"An angsty, introspective short with unorthodox visual style, Predestination takes us on a journey of self-awareness as a disillusioned philanderer deconstructs his life. Haunting and cerebral, Predestination will leave you wondering if we as human beings are really as free as we think.","release_date":"2013-10-13"},{"vote_count":0,"id":376399,"video":true,"vote_average":0,"title":"Predestination Debate: For whom did Christ die?","popularity":1.012941,"poster_path":"\/i8BaHJ8TLpxZREkZ6KTPQbnkPzj.jpg","original_language":"en","original_title":"Predestination Debate: For whom did Christ die?","genre_ids":[],"backdrop_path":null,"adult":false,"overview":"This is a debate held live on Revelation TV between Dr. James White and Dr. Michael Brown, about the nature of Atonement.","release_date":"2014-01-24"},{"vote_count":0,"id":449432,"video":false,"vote_average":0,"title":"All You Zombies: Bringing 'Predestination' to Life","popularity":1.030269,"poster_path":"\/uD2S0EPfoQFjdUr6IjAamEURsPJ.jpg","original_language":"en","original_title":"All You Zombies: Bringing 'Predestination' to Life","genre_ids":[99],"backdrop_path":null,"adult":false,"overview":"Documentary about the making of the Spierig Brothers' 2014 film PREDESTINATION that is based on Robert A. Heinlein's 1959 science-fiction short story '—All You Zombies—'. Through interviews with cast and crew, film clips and behind-the-scenes footage, this documentary thoroughly explores how the film came to be from casting to pre-production to principal photography to post-production. Interviewees include writers\/directors Michael and Peter Spierig, producers Paddy McDonald and Tim McGahan, director of photography Ben Nott, special makeup effects designer Steve Boyle, production designer Matthew Putland, special makeup effects supervisor Samantha Lyttle, costume designer Wendy Cork, film editor Matt Villa, and actors Sarah Snook, Noah Taylor and Ethan Hawke.","release_date":"2015-02-10"}]}